num_dict = {'শূন্য' : 0, 'এক' : 1, 'দুই' : 2, 'তিন' : 3, 'চার' : 4, 'পাঁচ' : 5, 'ছয়' : 6, 'সাত' : 7,
            'আট' : 8, 'নয়' : 9, 'দশ' : 10, 'এগারো' : 11, 'বারো' : 12, 'তেরো' : 13, 'চৌদ্দ' : 14,
            'পনেরো' : 15, 'ষোল' : 16, 'সতেরো' : 17, 'আঠারো' : 18, 'ঊনিশ' : 19, 'বিশ' : 20,'কুড়ি':20, 'একুশ' : 21,
            'বাইশ' : 22, 'তেইশ' : 23, 'চব্বিশ' : 24, 'পঁচিশ' : 25, 'ছাব্বিশ' : 26, 'সাতাশ' : 27, 'আটাশ' : 28,
            'ঊনত্রিশ' : 29, 'ত্রিশ' : 30, 'একত্রিশ' : 31, 'বত্রিশ' : 32, 'তেত্রিশ' : 33, 'চৌত্রিশ' : 34, 'পঁয়ত্রিশ' : 35,
            'ছত্রিশ' : 36, 'সাঁইত্রিশ' : 37, 'আটত্রিশ' : 38, 'ঊনচল্লিশ' : 39, 'চল্লিশ' : 40, 'একচল্লিশ' : 41,
            'বিয়াল্লিশ' : 42, 'তেতাল্লিশ' : 43, 'চুয়াল্লিশ' : 44, 'পঁয়তাল্লিশ' : 45, 'ছেচল্লিশ' : 46, 'সাতচল্লিশ' : 47,
            'আটচল্লিশ' : 48, 'ঊনপঞ্চাশ' : 49, 'পঞ্চাশ' : 50, 'একান্ন' : 51, 'বায়ান্ন' : 52, 'তিপ্পান্ন' : 53, 'চুয়ান্ন' : 54,
            'পঞ্চান্ন' : 55, 'ছাপ্পান্ন' : 56, 'সাতান্ন' : 57, 'আটান্ন' : 58, 'ঊনষাট' : 59, 'ষাট' : 60, 'একষট্টি' : 61,
            'বাষট্টি' : 62, 'তেষট্টি' : 63, 'চৌষট্টি' : 64, 'পঁয়ষট্টি' : 65, 'ছেষট্টি' : 66, 'সাতষট্টি' : 67, 'আটষট্টি' : 68,
            'ঊনসত্তর' : 69, 'সত্তর' : 70, 'একাত্তর' : 71, 'বাহাত্তর' : 72, 'তিয়াত্তর' : 73, 'চুয়াত্তর' : 74, 'পঁচাত্তর' : 75,
            'ছিয়াত্তর' : 76, 'সাতাত্তর' : 77, 'আটাত্তর' : 78, 'ঊনআশি' : 79,'আসি':80, 'আশি' : 80, 'একাশি' : 81, 'বিরাশি' : 82,
            'তিরাশি' : 83, 'চুরাশি' : 84, 'পঁচাশি' : 85, 'ছিয়াশি' : 86, 'সাতাশি' : 87, 'আটাশি' : 88, 'ঊননব্বই' : 89,
            'নব্বই' : 90, 'একানব্বই' : 91, 'বিরানব্বই' : 92, 'তিরানব্বই' : 93, 'চুরানব্বই' : 94, 'পঁচানব্বই' : 95,
            'ছিয়ানব্বই' : 96, 'সাতানব্বই' : 97, 'আটানব্বই' : 98, 'নিরানব্বই' : 99, 'এক শত' : 100,
            'একশত' : 100,'একশ' : 100}

opdict = {'যোগ':'+','প্লাস':'+','পিলাস':'+','চোখ':'+','জোক':'+','+':'+','মাইনাস':'-','-':'-',
          'বিয়োগ':'-','বিয়োক':'-','বিয়গ':'-','বিয়োগ':'-','*':'*','ইনটু':'*','ইন্টু':'*','গুন':'*','গুণ':'*',
          '/':'/','ভাগ':'/','ভাঘ':'/','বাগ':'/','বর্গমুল':'sqrt','বর্গমূল':'sqrt'}

rep_dict ={'0':'০','1':'১','2':'২','3':'৩','4':'৪','5':'৫','6':'৬','7':'৭','8':'৮','9':'৯',
           '*':'×','/':'÷','sqrt':'√',}

eng_rep_dict ={'*':'×','/':'÷','sqrt':'√',}