import unittest
from speech_to_exp import SpeechToExp as sp

class Test(unittest.TestCase):
    def test(self):
        self.assertEqual(sp('১ লক্ষ ৫৭ হাজার যোগ ১৫',0),('157000+15',157015))
        self.assertEqual(sp('এক দুই ৩ ৪ যোগ ১২ দশমিক ১৫১', 0), ('1234+12.1510', 1246.15))
        self.assertEqual(sp('- ১৫৬৭ যোগ - ১০৮ দশমিক ৫ সাত', 0), ('-1567+-108.57', -1675.57))
        self.assertEqual(sp('১ হাজার যোগ এক ২৪ দশমিক ৫৮ বিয়োগ ১ লক্ষ ৫২ হাজার সাত শ ছেষট্টি', 0), ('1000+124.580-152766',-151641.42))
        self.assertEqual(sp('+ ১৫ হাজার - + ১৬', 0), ('+15000-+16',14984))
        self.assertEqual(sp('+ বর্গমুল ১৭৭ - বর্গমূল ১৭৭', 0), ('+sqrt(177)-sqrt(177)',0))
        self.assertEqual(sp('উত্তর যোগ ১৭ - ১৮', 178), ('178+17-18',177))
        self.assertEqual(sp('- ১ লক্ষ ৪৭ হাজার ৫৭০', 0), ('-147570',-147570))
        self.assertEqual(sp('৫ পাওয়ার ২', 0), ('5**2',25))
        self.assertEqual(sp('একশত ৭.৩৪ যোগ - দশমিক ৩৪', 0), ('107.340+-0.340',107.0))
        self.assertEqual(sp('ছয়শত ৭.৩৪ যোগ - দশমিক ৩৪', 0), ('607.340+-0.340',607.0))
        self.assertEqual(sp('দুই লাখ চব্বিশ হাজার একশ এক যোগ দুই', 0), ('224101+2',224103))
        self.assertEqual(sp('নিরানব্বই হাজার নয়শ নিরানব্বই যোগ এক', 0), ('99999+1',100000))
        self.assertEqual(sp('আটষট্টি বিয়োগ ষোল', 0), ('68-16',52))
        self.assertEqual(sp('বর্গমূল সাতচল্লিশ', 0), ('sqrt(47)',6.86))
        self.assertEqual(sp('উত্তর গুণ দশ', 12), ('12*10',120))
        self.assertEqual(sp('ঋণাত্মক এগারো গুণ দশমিক এগারো', 0), ('-11*0.11',-1.21))
        self.assertEqual(sp('বর্গমূল ছাপ্পান্ন বিয়োগ পঁচাশি গুণ নিরানব্বই ভাগ ঋণাত্মক বাইশ', 0), ('sqrt(56)-85*99/-22',389.98))
        self.assertEqual(sp('তেতাল্লিশ ভাগ শুন্য', 0), None)
        self.assertEqual(sp('আটাশ গুণ ষাট ভাগ ঊনআশি', 0), ('28*60/79',21.27))
        self.assertEqual(sp('ঋণাত্মক ৭৩.১২ গুণ ১২০.৯০ ভাগ বর্গমূল একুশ', 0), ('-73.120*120.900/sqrt(21)',-1929.09))
        # self.assertEqual(sp('33 সূচক নয় গুণ ৯ সূচক 33', 0), ('33**9*9**33',))
        self.assertEqual(sp('55 পাওয়ার ৫ ভাগ ৬৬ ঘাত ছয় গুণ বর্গমূল সাতাত্তর বিয়োগ ঋণাত্মক 9.55 যোগ দশমিক ৫', 0), ('55**5/66**6*sqrt(77)--9.550+0.50',10.1))
        # self.assertEqual(sp('বর্গমূল ৫৬ -৮৫ গুন ৯৯ ভাগ -২২', 0), ('sqrt(56)-85*99/-22',389.98))
        # self.assertEqual(sp('', 0), ('',))


if __name__ == '__main__':
    unittest.main()